[
    {
        "title": "4 years ago I wrote a case study on reddit on my $4k per month local business. I've since built that company into a multi-million dollar company and the redditors that followed are now doing a combined $50 million dollars per year! Updated case study and AMA.",
        "upvotes": 4345,
        "num_comments": 821,
        "comments": [
            "[deleted]",
            "[deleted]",
            "How do you find and vet the people you hire to do these services? That seems to be the trickiest part. ",
            "Sorry to be cynical, but isn't this entire post basically a giant advertisement for your SaaS website?\n\n> Tuesday Jan 24th: Sign up at Launch27 (Full disclosure: I’m an owner)\n> This is going to be the software that runs the entire business, from booking form, to recurring bookings, to credit card integration, to customer database, the entire shebang. The booking form you get here you will add to your website with a simple copy and paste. \n\nI mean, maybe you didn't intend it to come across that way, but it follows the pattern pretty clearly. \"Look at these people making $$$ using my system! Follow these easy steps and you can too! Just sign up for my website for $59/month...\"",
            "It seems to me the biggest challenges you would have but somehow overcame would be the one that hit Homejoy (or supposedly did): \n\n1) Clients engaging jobs directly with your cleaners which means every new client is client just a few times and cleaners cycle rapidly.\n\n2) Having cleaners perform reliably, consistently and honestly without all the human issues that plague companies with employees.\n\nAre your hiring filters enough to take care of that or are there other things that you do systematically? How much firefighting do or did you have to do (X cleaner doesn't show up, panic time or cleaner/customer drama)?",
            "Thanks for the post. It seems like a lot of the value you/we can provide is customer service and I would expect that to equal phenomenal reviews on Yelp as you mention that as a big tool for gaining customers.\n\nLooking at Yelp for Maids in Black and Lawntribe in DC you're at 4 and 3.5 stars respectively. Many of your competitors have 5 stars with 50+ reviews.  What's the main reason for the lower reviews with your companies?  \n\nPlease don't take this as any knock on you or your businesses. I just think that most of us see you as the gold standard for service businesses and if this is an area you are struggling with it would be really difficult for those of us looking to start.  Especially once our business grows and we are trying to provide great service for an ever expanding customer base.\n\nThanks again for all you contribute to this sub!",
            "Getting a few reports on this so I thought I would recognize the issues raised and make sure everyone knows what is going on.\n\n**Reports about self-promotion and spam:** u/localcasestudy owns launch27.com and Groovehiring which he points out.  These sites provide services for service booking businesses. When you read his posts please keep in mind he does have cause to favor it - but he also points that out himself (\"...if we do say so ourselves..\"). People doing AMAs are allowed to provide a modest number of links to their company if it is material to their AMA which certainly seems to be the case here. Given that guideline, given that there are no affiliate links in the OP and given the relative amount of information to links I don't think the post would qualify as spam, particularly given ongoing involvement in Q&A. One other concern might be if the video content were all self-promotional. I will be reviewing the videos shortly but given the titles/descriptions I don't expect them to be simply cloaked sales pitches for real information.\n\n**One report was for threatening and harassing.** There doesn't seem to be anything like that in the OP. If you were serious about this report please contact the mods. If a comment was harassing please report that specific comment so we can investigate. \"Harassing\" means attacks on you as a person it does not mean saying something you disagree with or attacking your concepts, thoughts or position on issues. Criticism is fair game. Name-calling or worse is not. We take these type of reports very seriously but reporting something as threatening to try to raise alarm level when it is not is just as serious. Only use this type of report if you are being harassed or threatened.\n\n\n---\nEdit: So this post explaining why I did what I did has now been reported as \"Mod team are shills\" and \"Fucking stupid.\" Everyone is free to respond to this post and point out why I am wrong. I listen to that and consider it. If you make a solid case I will change my position on things. It is important to me to be logical and rational and that means recognizing I can be wrong. \n\n---\nEdit: I'm asking the other mods to take a look and review the post to find out if I was in error making this a sticky as an AMA and to make sure I am not being biased in evaluating the reports. I would much prefer a discussion of why people see this as an ad rather than an AMA (yes, I do understand the formatting suggests ad and the phrasing feels marketing but when I drill down to look at how much is actually promotion I see promotion of a concept rather than a service. Haven't reviewed the videos yet though.) Please tell me how I am wrong. I will be reviewing the back and forth both in this post and others.\n\n---\nEdit: So a fair number of the reports seem to be saying it is improper to have this stickied. One asked how much I was paid to sticky it (nothing incidentally, I thought it would qualify to be stickied under our past AMA guidelines). Since that was just my call and since I've asked the broader mod team to review it I will be unstickying it until they do so and decide how to go. **Was it a mistake for me to sticky it? I think so but not for the reasons you might think.** I think it was acceptable to do so under our policies for AMAs but I don't think that it helped the community. The post was already visible to everyone because of the supporting upvotes it had received. Stickying it just pissed off people who didn't want to see it. I didn't see that coming and apologize for missing it and doing the wrong thing. Trying to help and failed. Sorry",
            "[deleted]",
            "I don't know and don't care why so many ppl are worked up about your post. I recently spent about 4k starting my first business and I've made like 6 sales because I apparently suck at ecommerce, so its not going great. I'm not deterred by the rough start and your post has inspired me to look into local sales as well as starting a business based on the model you present\n\nYour post shows , if nothing else, that it's very possible to start a successful business and change your life in 30 days. Whether it's an ad or not, your post is the most informative and useful I've read on him this sub in months \n\nSo thanks for being awesome",
            "Why go through all this work to give people ideas on how to make money and possibly even compete with you? What's your angle?"
        ],
        "sentiment": 0.045394505688110334,
        "score": 9511.453945056881
    },
    {
        "title": "I've challenged myself to make $100K in 100 days (DAY 100)",
        "upvotes": 3350,
        "num_comments": 356,
        "comments": [
            "So why not use this knowledge and experience and challenge yourself to make 50k in the next 100 days?",
            "I saw your progress update posts on here, I think you've got a great attitude. Just the commitment of making regular update posts and being introspective enough to derive lessons from the experience already speaks volume about you as a person. Best of luck on your journey",
            "Props for following through. I remember the “we’ll never see you again” comments on your first post.",
            "You made an extra $10k more than you had 100 days ago, I'd call that a win in any way shape or form.\n\nMaking 100k from scratch in 100 days was doomed to failure.\n\nIf I could find a way to make an extra 10k every 100 days...I'd be all over it.",
            "Tl;dr 100 days. Find one thing focus on it become the best, scale it, get good at sales marketing. Check",
            "I really respect that you kept on with the updates, despite completely missing your goal. I think most people would have made a few updates at best and then just quietly stopped posting in the hopes that nobody remembered what they'd set out to do. \n\nWould you try a challenge like this again in the future? If so, would you adjust your expectations at all? Is there anything you might change aside from addressing your notes on why you didn't achieve your financial goal?",
            "I’m curious, where did you find your freelance projects? Upwork? I’m a SWE and looking into freelancing.",
            "First, congratulations on the $10,144.  That's not chump change for side work.\n\nI think the two most valuable things that you learned are what so many people overlook.\n\n1) A plan ( business plan)\nThe more complete and detailed your plan is the more focused it will keep you, and improve your opportunity for success.\n\n2) Sales (and marketing)\nWithout selling your product or service, one can expect their revenue to be $0 and profitability to be  a loss.",
            "You say the freelance job was not very entrepreneurial even though it made the most money. I feel like opportunity is staring you in the face. Try to get more gigs like that.",
            "So you tried many things and two worked. Of those two, one is simply a job and isn’t scalable as it currently is. \n\nThe other “slowed down”. I would look into that and figure out how to keep it going. Where else can you market? How can you scale? What are other people doing right? What are they doing wrong where you can differentiate?"
        ],
        "sentiment": 0.23504365079365078,
        "score": 7058.350436507936
    },
    {
        "title": "Mistakes I Wish I Hadn't Made (after building 30 startups)",
        "upvotes": 1543,
        "num_comments": 254,
        "comments": [
            "In my limited time bootstrapping my own stuff, I raise a glass to your list.\n\nMy version:\n\n* **B2B > B2C** (except if you've some specialized unserved niche that you can have an app up and running in a few days and are willing to just gamble).\n* **No VC** - I haven't done VC, but hear horror stories. One interview I heard yesterday said, if you make a $2M business as a bootstrapped company you're a success. But in VC you need to get to $100M. However, how many businesses can get to a $100M valuation. You're setting yourself up for failure.\n* **Nail outreach** - distribution will make or break you. Outreach + no product = pre sell product. Product + no outreach = no sales.\n* **Yes to SEO & Content; No to relying on it 100%** - Google is seriously monkeying with search results. So you need SEO and content, but make sure you have other avenues as well.\n* **Piggyback off other traffic sources** - Reddit, Pintrest, Quora, YouTube, TikTok, Instagram, Facebook, etc. Know them. Love them.\n* **The Time Investment to Validation Ratio** - the longer it will take to build something, the longer you should take to validate it. If you can get it up in a weekend or a week, then you can risk less validation.\n* **Off the shelf as much as possible** - At the beginning you have no idea if your project will work. So it's easier to start with a $199 boilerplate than spend 3 months reinventing the wheel. Use as many off the shelf and free tools as you can. Google Forms are your friend. You can even create signable documents in JotForm for free.\n* **Tiny MVP:** I know so many successful projects that started out as a Excel or Google sheet. Start with the minimum minimum viable product. Try to not code at all until you have paying customers.\n* **The \"Jay Leno\" approach** - If at all possible have a day job. When your project gets traction, then jump to it. Jay Leno said he's never lived off his tonight show money. He lives off the earnings from his stand up gigs. I've seen a lot of successful projects that were helped by this model.\n* **Either people buy your product/service or they don't** - You'll get so many \"that's a great idea\" or \"I'd be open to using your service in 6 months when you launch\" or \"I love this, let me talk to my boss\" or \"this could be a great partnership for us where we can send you a lot of business let's spend the next 6 months working out a deal\" or \"how about we use your service for an equity deal in our company that hasn't made any money yet\". Farts in the wind. Cash in hand is the ultimate validation.\n* **Research, Research:** Look up how much competition you'll have on Google. Find a successful business model to copy and ask what are their traffic sources and how long have they been successful. Understand your market.\n* **The Long Haul:** Something may be a great idea, that serves a market, that's validated, that's easy to build, but ... do you want to work on this idea and promote it for the next 3-5 years? Launching is one thing. Continuing to put effort into it is a whole other challenge.\n* **Sunk Cost Quicksand:** It's very hard to kill a project after you've put years into it. I've been working on a site for 2 years with zero monetary returns. Currently I'm transitioning it to a more passive model and will let it just exist. But it's very hard not to want to put more effort into it when I know it could have potential. One developer says if you haven't made any money with it in 3 to 6 months, you should probably kill it. However, I know a project that's currently making $70K MRR but it took them 3 years to get to $1K MRR. So it's a tricky balance to know if you're being persistent or being a fool.\n* **Get to Money Sooner:** Big funded companies can afford to exist in the red for years (or a decade), but most of us have limited money, time, and effort. The faster you can get a project, website, business to cash, they sooner you'll know you have traction.\n* **Some other lessons:** [https://twitter.com/adamdenverco/highlights](https://twitter.com/adamdenverco/highlights)",
            "This is gold.",
            "Good post OP. I just have a nit pick.\n\n> Today I have 1 fullstack dev doing 5x more progress on a project than a team of 12 back then. Avoid \"teams\" at all costs.\n\n30+ year Senior Dev here (who's also started and worked for startups). I retired earlier this year, but they just pulled me back in. Probably the most well known project I worked on was Apple's iCloud for instance. I wrote the load balancer they used to scale the huge Exabyte storage needs they had.\n\nYou probably have a really good fullstack dev. Or your apps are pretty simple. But at the end of the day it's impossible to have expertise in everything. Tech is just too complex for that. A person who keeps up with all the Front end madness that is happening (React, Svelte, TypeScript, node...) cannot possibly also be at the cutting edge about infrastructure the way a DevOps Engineer can. A guy writing front end will not be able to maintain a complex Kubernetes Operator in Go at the same time.\n\nThere is just too much context switching. And vice-versa, a DevOps guy isn't going to be great at front end design. Sure they can do it, but it will take 3 times longer and it won't look quite right.\n\nI'm sorry but that's just not a thing. In development pretty much every area is constantly evolving, and you have to keep up with it. No single person can really keep up with everything. \n\nIt just sounds like your businesses needed more front end guys, and you were hiring the wrong people for the job. Likely outsourcing difficult scaling back-end issues to other IaaS/SaaS providers.\n\nThough I do agree, 1 bad ass can outwork a team of 5 for sure. Hope you're paying your guy well.",
            "How did you have the willpower to keep going after the 5th, 10th, 26th etc start up failed? \n\nOr I’m maybe missing this part, how many of them failed?",
            "The \"doers\" one is gold, even if it isn't a bullet point. I'm the solo dev for a startup right now (full stack), and there are so many people that want to advise and tell us what to do and how to do it – partner as a consultant. \n\nWe don't need consultation, we need roll up your sleeves and code. Can't, please stop wasting our time. \n\nThis is something I wish the CEO would stop bringing up. Meetings with consultants... advice on how to do things. Talk is cheap.",
            "My mistakes of the most recent 2 startups (still going but not for much longer). I will try and keep one going as it's abit of a unicorn in my area, but it doesn't cover the bills on its own. I'll probably need staff so I can go back to a normal job.\n\n1. Maxing loans and buying loads of equipment, thinking I can do lots of different services. I'm seriously in the brown at the moment, highly unmotivated, burnt out, and completely lost with lots of toys, but no initiate or drive to do anything.\n\n2. Doing way way too much. For 2 years, I'd worked nearly ever hour I could, working full time 7-5 5 days a week, 5-11 and weekends on my 2 startups. 1 is the unicorn and niche, but only seasonal. The other was going to be the complimentary income. I've now finished my full time role, but it's caused me to go into a spiral. I'm unmotivated, lonely, tired all the time, and instead of it giving me 45 to 50 hours back a week, my output on the 2 side hustles just filled that time still with the same output/turnover, it's a mental and physical disaster. I'm over weight, in debt and mentally and financially at wits end! (Why can't I just be a normal person, 9-5 and play golf or hang out with my wife and friends? I'm highly self destructive!\n\n\nHaving a rubbish accountant. I'm still paying a lot of money and not getting anything good back. I've gone Limited after not taking any solid advice. For my last tax return, they did a soft check, made sure everything lined up roughly, then pressed send on my accounts software, and automatically submitted a return. Absolutely wasting money there.\n\nTaking on staff who, as op said... I wouldn't hug. They've rinsed my business of profit by doing half assed work... Left a bad taste in the mouth of any customer they've worked for... the majority of which I either lost or am still having to correct mistakes unpaid. I am trying to be a good manager. I don't think I am, I might be an ok supervisor, but I'm not great at getting the right people to do what I need. I need to work on that.",
            "I'm a young entrepreneur working to build a B2B services platform.\n\nWould be very happy to get some mentorship from you, if your time permits.",
            "Great insights\n\n\nBiggest regret is exactly the same as you with No.14\n\n\nUnfortunately it was initially going great so that really clouded my better judgment. I believed I was doing something wrong or just missing some final piece to the puzzle\n\n\nWas real \"I can save her\" energy",
            "How did you find the ideas needed to create 30 startups? And how did you validate your ideas afterwards? Did you have to build an MVP first or did you speak to your customers first?",
            "Excellent post. I see lots of things here relevant to me in manufacturing. Thanks.\n\nEdit: biggest regret: not firing fast enough when conditions change. Firing people sucks, but running out of money sucks more, then everyone loses."
        ],
        "sentiment": 0.16574370957970702,
        "score": 3341.657437095797
    },
    {
        "title": "I run an AI automation agency (AAA). My honest overview and review of this new business model",
        "upvotes": 1411,
        "num_comments": 221,
        "comments": [
            "Good Guide on RAG (retrieval augmented Generation)- super helpful if you are looking to get a high level overview of 90% of the solutions AAA's build: [https://www.pinecone.io/learn/retrieval-augmented-generation/](https://www.pinecone.io/learn/retrieval-augmented-generation/)\n\nHere are links to all platforms and tools I've mentioned in the post that's helped me\n\n**Python Libraries:**\n\n* Langchain: [https://python.langchain.com/docs/get\\_started/introduction](https://python.langchain.com/docs/get_started/introduction)\n* LlamaIndex: [https://docs.llamaindex.ai/en/stable/](https://docs.llamaindex.ai/en/stable/)\n\n**No-Code AI and Automation Tools:**\n\n* MindStudio: [https://youai.ai/](https://youai.ai/)\n* MyAskAI: [https://myaskai.com/](https://myaskai.com/)\n* Botpress: [https://botpress.com/](https://botpress.com/)\n* Voiceflow: [https://www.voiceflow.com/](https://www.voiceflow.com/)\n* Stack AI: [https://www.stack-ai.com/](https://www.stack-ai.com/)\n* Flowise: [https://flowiseai.com/](https://flowiseai.com/)\n* Zapier: [https://zapier.com/](https://zapier.com/)\n* make.com: [https://www.make.com/en](https://www.make.com/en)\n\n**Presentation and Prototyping Tools:**\n\nPlus AI (Google Slides add-on): \\[[https://www.plusdocs.com/\\](https://www.plusdocs.com/)](https://www.plusdocs.com/](https://www.plusdocs.com/))\n\n**Marketing and SEO Tools:**\n\nProfilePro (Chrome extension for Google Business Profile): [https://www.merchynt.com/profilepro](https://www.merchynt.com/profilepro)\n\n**Sales and Outreach Tools:**\n\n* Apollo.io: [https://www.apollo.io/](https://www.apollo.io/)\n* reply.io: [https://reply.io/](https://reply.io/)\n* zoominfo: [https://www.zoominfo.com/](https://www.zoominfo.com/)\n* Linkedin Sales Navigator: [https://business.linkedin.com/sales-solutions/sales-navigator](https://business.linkedin.com/sales-solutions/sales-navigator)\n* SmartWriter.ai: [https://www.smartwriter.ai/](https://www.smartwriter.ai/)\n\n**Miscellaneous (not gonna put links as you probably already know them)**\n\nUpwork (for sourcing talent)\n\nFiverr (mentioned in relation to content generation)\n\nTrustPilot (for business reputation)",
            "Can’t thank you enough for putting this together ya beast. How much are you netting per month with this? Average revenue per client etc?",
            "Bravo! I have not read a single comment, yet. This may have been stated but bears repeating.\n\nTHIS! This is a post of value. It may not be valuable to you, but it’s stuff full of actionable direction with a very dedicated layout for assisted execution. OP went above and beyond in helping those that want to take advantage of this opportunity and the timing is very relevant.\n\nLastly, do you notice the lack of any “I don’t want to share for fear that others will take my ideas.”\n\nYour idea is rarely unique, it’s likely been thought of before by someone that failed to execute or executed and failed.\n\nFailing equals growth, growth equals learning, and learning equals success.\n\nThat is, and only if, you execute! Keep your “ideas” to yourself, as that makes you comfortable (you being those that subscribe to this logic), though your ideas are worthless until you execute and learn in the process.\n\nKudos to OP for a gem of a post, I’m sure I speak for many when I say we would love to see more giving and less taking in this sub, as we all benefit if that were the case.",
            "this is a badass post, thank you.  I want to add [https://glideapps.com/](https://glideapps.com/) to the nocode list.  Great ai integration growing every week.  I work as a consultant building Glide apps for local business people I met through meetup business networking groups.",
            "I started pivoting my digital agency to an AIAA model over the last several weeks and these vids have been a big help…sharing for anyone else interested:\n\nHow to build an AI automation agency for beginners in 2024https://youtu.be/80BwZzZuvYk?si=EZVVUtsk_Pf-ayXh (https://youtu.be/80BwZzZuvYk?si=EZVVUtsk_Pf-ayXh)\n\nGet MORE AGENCY CLIENTS with this ai automation PITCH DECK (Templates Included)\nhttps://youtu.be/KAJPWyVxYMo?si=gBa4SfKrdW8UAKIX\n (https://youtu.be/KAJPWyVxYMo?si=gBa4SfKrdW8UAKIX)\n\nHow We Get Paid Helping Businesses Use AI (Agency Casestudies)\nhttps://youtu.be/3Z5w0bJNjLo?si=KA8hHb9G2vZZex_6 (https://youtu.be/3Z5w0bJNjLo?si=KA8hHb9G2vZZex_6)",
            "This is a gem",
            "I have 1 employee, chatgpt. They make me $300+ a month (copy & paste). still ways out there",
            "This is a really great overview of what I've been considering. At the moment I'm a product manager, using a combination of AI, automation, and low code/headless cms tools to scale processes or to make them more efficient. I love the application of the tech in complete solutions more than just living on the bleeding edge of AI technology.\n\nMy background is systems engineering, which is just the idea of treating your entire business or domain as a system of systems that are interconnected. AI isn't a tool that solves all problems, but can be deployed in components of the business. Being able to conceptually understand a business's needs combined with understanding what AI tools are out there I think is a nice intersection.\n\nI was considering that it might be possible to focus on local businesses as well in areas that aren't particularly tied into the latest emerging technology.",
            "Pure gold!!! If anyone is interested to keep having these conversations, please let me know. Really hoping to be surrounded by those 'in the trenches' of building out AI + automations + operations.",
            "Nice one! I have thought about something like this for e-commerce in particular. But I have a habit of straying from what is actually making me money and getting distracted lol. In the pipeline"
        ],
        "sentiment": 0.1112971623770966,
        "score": 3044.112971623771
    },
    {
        "title": "How I went from $27 to $3K as a solopreneur still in a 9-5",
        "upvotes": 992,
        "num_comments": 280,
        "comments": [
            "Awesome ! Congratulations and i enjoyed reading the ups and downs. Great Story telling!",
            "Read this as \"went from 27k to 3k\" and was like hold up a minute lol",
            " Is it 3k a month or 3k total?",
            "[removed]",
            "Dude! you just gave me the shot I need to complete my journey as a solo founder, I started feeling like giving up is the best I can do. Thank you so much",
            "Was pleasantly surprised he wasn't selling a course by the end of the post. Good job OP.",
            "Sorry, Your post is amazing, I understood the first project where it was $27/use. I'm not sure I understand the second project though, what are you selling? is it a service? or where is your revenue from?",
            "Hi OP,\n\nMany thanks for sharing your experience, especially disclosing the ideas you worked on. This is quite rare from entrepreneurs and much appreciated !\nWishing you the best, and way more than 3k$ !",
            "Nice one! Happy for you, I recently came across all these folks you’re talking about and was dwelling on doing the same! Gives me hope that it’s doable",
            "I seriously love this for you. This type of thing is actually what got me started professionally with software development 20+ years ago. I found a problem, and provided a solution for it. It was just some silly little consolidated order form / checkout process (ROrder) for some web host billing softoware that was popular at the time (Modernbill) before they got bought out by Plesk. \n\nI've always loved building software, and creating things from nothing, and that little project earned me about 10k in sales over a summer before I ended up selling the product to someone else a year later. At 21 you'd better believe I was stoked. It was the first glimpse I had of it actually being possible to earn a living doing something I love. \n\nI continued to run a small web hosting service and take on one-off coding requests form clients. Almost all of which went on my resume. As someone who didn't finish college, I needed all of the experience I could get. A couple of years later, a small company reached out to me, through monster.com (god I'm old, lol). I've been with the same company for almost two decades now, and I couldn't imagine doing anything else. \n\nAll because of some project that I cooked up over a summer. I sincerely hope you find success. You've got this."
        ],
        "sentiment": 0.3442835497835498,
        "score": 2267.4428354978354
    },
    {
        "title": "It’s FINALLY happening, My SaaS has made $6k in its first month!",
        "upvotes": 678,
        "num_comments": 109,
        "comments": [
            "Didn't you post this same thing a month ago?",
            "Sick ad bro",
            "How much do you spend on ads",
            "Interested in knowing where you studied and whats ur experience!",
            "Congrats! huge milestone.  I started my business in Jan 2023 and just broke $2m revenue in 2024 as a solopreneuer.  All it takes is 1 foot in front of the other, and then 2 years later you can turn around and see how far you've gone.  KEEP GOING!",
            "Congratulations",
            "Very nice work dude keep it up!",
            "I thought all chrome extensions were free? Do you take orders via stripe/paypal by poping up some type of paywall when a user tries to access a premium feature ?",
            "Thanks for sharing! Congratulations on all the success!",
            "Congrats!"
        ],
        "sentiment": 0.1335714285714286,
        "score": 1466.3357142857142
    },
    {
        "title": "I Started with $50 and Pursued 27 Different Business Ideas Over 6 Years… AMA",
        "upvotes": 549,
        "num_comments": 165,
        "comments": [
            "Really good observation about being a participant or an observer. \n\nIm a serial entrepreneur. Two of the products that I created (1st one made $150k lifetime and second one made $350k lifetime) I was a participant and I solved a personal problem and provided it as a service. \n\nI also started an e-commerce business which did close to $1m in gmv by purely being early. 18 months down the line the market was saturated and I couldn't turn a profit, I had to shut it down.",
            "Thanks for the insight. It was an interesting read.\n\nI actually agree with you when you talk about finding a product that solves the problem, if there is a market for it then it's probably one of those businesses that could explode. My question would be related to supply, you spoke about how your friend wanted those hoodie blankets so there must have already been people who sell those products otherwise they wouldn't have thought about buying it. So my questions are:\n\n1. How saturated was the market when you started your business?\n2. What was the key differentiator between your product and the competitors that made the business work?\n3. How did you source the product?\n\nIf you don't mind sharing your answers for those, it would be a great learning point for me as an aspiring entrepreneur.",
            "[deleted]",
            "What are these businesses",
            "The one thing I disagree with is that you don’t come up with good ideas by copying someone else’s business. \n\nPeople since the beginning of time have been killing it by just providing a better service or product than their competitor. \n\nThink about how many different businesses there are for quite literally anything. Restaurants, landscaping, heck even vacuum’s. \n\nCompetition is GOOD. It means the idea works, and you can make a metric ton of money by thinking of not something new to do, but how to do something better. \n\nYou’ll also save a ton of time as you won’t be spending it on your own half-baked ideas.",
            "[removed]",
            "What you did here is chase a trend, that could work but it doesn't last for years. If you pursue those kind of trends you need to be prepared to get the next one, and while the first one works and is in full swing you need to come up with the next, and do a lot of flips.\n\nthat's a thing you can do, and as any thing, some might have success some might not due to various reasons, came too late, didn't execute right, had too big prices, to low profit margin.\n\nI would apply a different strategy:\n\n- choose a boring service or product you can do and build on that\n\n- keep a minimum level job that helps you survive for at least 2 years\n\n- have patience, the more boring your product or service the better, of course you have to have people using that kind of product or service. So you cant sell candles or something.",
            "I appreciate you sharing your journey. Best wishes to you for the future!",
            "Really great story. And definitely what I've learned to do as a product manager in tech. Congrats!",
            "How do you find a supplier for all these things? Hoodie blankets, jewelry, etc.? Are you dropshipping them?"
        ],
        "sentiment": 0.16959787071394214,
        "score": 1264.6959787071394
    },
    {
        "title": "I'm 26 and started a successful SaaS business with 73 customers & $22k in revenue. I spent none of my own money, it wasn't my idea, and I don't know how to code. Not possible? I'll prove it to you..AMA",
        "upvotes": 294,
        "num_comments": 422,
        "comments": [
            "THIS is what I want to see more from this subreddit. \nIf you had nothing at the start, how did you get the idea? and if you couldn't code, how did you get the money to hire developers?",
            "How did you convince people to pay for a product before it existed?",
            "I'm sure you'll satisfy us with more details of your business, but even without knowing those details yet - 9 months, 73 paying customers, $22k, development 100% funded - - That deserves heaps of respect. Seriously, that's accomplishing something. \n\nTime will prove you and your business, of course, but judging by the last 9 months, the hardest 9 months of any business, in my opinion MySky is picking up momentum at a pretty incredible rate. ",
            "Why the negativity in this thread? If you've done better, please do an AMA and share your knowledge. While this guy might not be doing everything/anything the right/best way, the hostile tone i'm reading in some of these comments makes me think some people want to spend more time putting this guy down to make themselves look important, rather than actually constructively contributing.",
            "How do you evaluate the skills of the employees/contractors who write the code if you don't have any experience on the tech side? I'm having trouble judging quality of technical work that I have no expertise in and it's causing some stalling on my projects because I can't afford to pay multiple people for \"test run\" jobs. ",
            "Don't you think it's a little early to call yourself a \"Successful SaaS business\" with just $22K in revenue? Did that amount fund the development of the app, or is it your annual revenue? Is your company profitable, and how do you pay yourself from $22K in revenue? Do you have investors?\n\nEdited*",
            "What's your cost per customer acquisition?",
            "Who wrote the code and how did you get them to write the code? \n\nHow did you get into the incubator and at what point along in your progress?",
            "what do you do to promote your product?\n\nhow did you get in contact with your (pre)customers in the first place?",
            "As someone who loves the SaaS model and see great potential in the future, congratulations on your awesome growth. Very impressive. \n\n1) You said you got the idea from your customers, what does that mean exactly? Did you one day call up potential customers, ask them what you could help them with, or did you you have a general idea and build upon that? \n\n2) How is your software different from sales force or hubspot? Are small businesses reluctant to use these services? \n\n3) What is your prior work experience and educational background? \n"
        ],
        "sentiment": 0.16702564102564102,
        "score": 1011.6702564102565
    },
    {
        "title": "First Million, the hardest",
        "upvotes": 393,
        "num_comments": 125,
        "comments": [
            "Congrats! I started in 2022 and I made about 25k :)",
            "Welcome to the middle class!",
            "Nice exit plan, and I wish you all the best in your next journey.",
            "Nice return in such a short time as well. Have you a certain industry in mind? \n\nI’ve created and sold 2 companies before, not for as large an amount as that. Taken the last year out of any type of business/earning just for some down time. \n\nReady and raring to get into something but I’m now stuck with paralysis analysis. Can I ask if you were AI qualified so to speak when you started your company? Tech interests me a lot but it’s not my strongest when it comes to knowledge.",
            "This is very interesting! Was it much different than a simple mail merge via outlook email? \n\n\nThis does give me hope that a saas product can do well (indie saas projects rather than large platforms)",
            "Welcome and congratulations!",
            "A bit of an unrelated question: why is it so great to sell? I’m a big fan of founder-led companies because they usually have more long-term view.",
            "Well done mate. What study ressource would you recommend ? Already a sysengineer in tech but want to move more to software/ai",
            "Hey, I’m really interested in building AI agents and have been researching this topic for a while now. I want to cater to small businesses and do some good for that community. Would really appreciate connecting with you to explain my current state and how+ where I can improve going forward to make this dream a reality :)",
            "Congrats! Currently in big tech debating a similar move.\n\n1. Did you stay in the bay? Or move to a lower cost of living area?\n2. Would you recommend going full time on an idea or finding a stable 9-5 that is flexible and allows after hours work?\n3. Was it hard to pull the trigger on starting? How did you move past that?\n\nThank you :)"
        ],
        "sentiment": 0.38126984126984126,
        "score": 914.8126984126984
    },
    {
        "title": "How to start finding SAAS niche and implement SAAS idea? For anyone looking to build $1K MRR to $10K MRR",
        "upvotes": 394,
        "num_comments": 67,
        "comments": [
            "Really interesting share, thanks.\n\nI have a burning question: why sell the ideas when you can implement them yourself to make the MRR itself?",
            "Any reason you're not including typeform? it probably has higher ARR than gravity.",
            "Forms sound great, but paid newsletters are where it's really at, right? This is why OP is writing this post, after all.\n\nSo OP's newsletter is $50 for 3 months, which is roughly $16.60 - let's say after Gumroad fees that works out to about $15/mo.\n\nIf he gets 1000 users signed up, he's sitting on $15,000/mo which works out to $180,000 a year.",
            "Awesome post. I'm literally planning on launching a form builder on November 30, 2020. It's called keenforms, it's a form builder plus a no code rules engine. It's distinct in that it can do conditional calculations and validations.\n\n[https://www.keenforms.com](https://www.keenforms.com)\n\nIt's a side project that I've been building (on and off) for 3 years. It's free to try, paid plans will be ready in the new year.",
            "rule 1. stay away from \"how to make money online\" kind of things",
            "> If you are looking for this high quality newsletters every week, subscribe at https://gumroad.com/l/the-next-idea-pro\n\nI'm curious how well this is working out for you.   How many subscribers do you have?",
            "It seems providing business ideas as a service is rapidly evolving as a great service these days. I've subscribed to one myself and it's a pretty decent one and here are my 2 cents based on a paid subscription to a business ideas subscription.\n\nYou need 3 tests for an idea to really bootstrap an idea successfully:\n\n1. I**s there demand for this solution? is this addressing a burning pain?** in this case it's not. I agree with the fact that there is room for custom forms and that's why there are too many solutions. But the big question is are they profitable? There are some people looking for custom solutions but are they big enough a market for building a custom product? Are they all looking for the same solution or they are asking for very high customization?\n\n**2. Can I build and sell this solution?** building it would be easy, but selling it would be tough. First of all, OP admits it's a crowded market. And some of the players are funded. If you are competing with funded players for marketing space, we all know the outcome (look at Uber Vs Taxi industry, Airbnb vs individual hotel owners)\n\n**3. Am I interested in creating this?** well, in case you are trying to build something from an idea subscription, you have to wait in a never ending queue to see something you are really passionate about. That's my opinion from the subscription.\n\nI've never seen anyone in my life who failed in a business and admitted that they failed because their idea sucked (including myself). The reason is when people come up with an idea themselves, they would find a ton of different excuses except for the fact that the idea sucked. People have that conviction about an idea because it's original. But will they be able to build something and have equal conviction in case of borrow-and-build approach?",
            "I assume lack of time and passion for this:D",
            "[deleted]",
            "I work building what is, essentially, a very fancy survey tool, and this is spot on. There are a ton of niches is data collection and a lot of avenues that haven't been fully addressed by the one-size-fits-all approach"
        ],
        "sentiment": 0.24814162745467092,
        "score": 857.4814162745467
    },
    {
        "title": "I bootstrapped a SaaS business from idea to $20,000+/mo in recurring revenue in 11 months, made all of our revenue metrics public, raised $500k in funding and have hired 6 people. AMA",
        "upvotes": 216,
        "num_comments": 173,
        "comments": [
            "Hello and congratulations on your growth, and great looking product.\n\nAre you concerned at all that partnering with Stripe so closely will dissuade other potential buyers or investor in the future? \n\nThat \"under the hood\" access to Stripe you mention in the blog, do they have a contractual obligation there or is that part good faith and handshakes? Would the nature of your constructive relationship with Stripe be altered if you started focusing on a competing platform? Interested to hear your thoughts.\n\nAgain, congrats on your success, oh and what's your favorite Biggie song?",
            "What challenges have you had running a 100% remote team?  \n\nI assume you had another job during the first 7 months, what was your strategy for finding time to build out this product?\n\nWhat was your decision process in jumping in to building your startup full-time?\n\nHow did you get the word out about your product at the very beginning?\n\nI'm where you were 7 months ago, so I really appreciate the insight!",
            "Wow, I'm a huge fan on your product! My questions:\n\n* How did you identify the need for your product?\n* How did you validate the concept?\n* Are you employing any type of lean startup methodology? If so, what are you doing?\n* What are the biggest advantages and disadvantages of having a remote team?",
            "What has been your experience in not having a .com domain? Would you do anything differently in regards to web hosting if you went back to the beginning? ",
            "Are you not worried Stripe is just going to support these features in the future?",
            "How much share of the company did you give up for the 500k?",
            "I was an early paying user of Baremetrics.  I can confidently say that it kicks ass. Josh is super nice, helpful, and smart -- and reachable. Thanks buddy.",
            "[deleted]",
            "What do you believe is most important in the hiring process?\n",
            "I'm in a very similar boat being a one man show right now. Could I just get some feedback on landing page/concept? Check it out here https://bashoto.com \n\nAwesome to hear that a solo founder can be successful. Most of the feedback I get is that I don't stand a chance by myself."
        ],
        "sentiment": 0.21015376984126982,
        "score": 607.1015376984127
    },
    {
        "title": "Chasing dreams? It’s like swimming through shit",
        "upvotes": 165,
        "num_comments": 213,
        "comments": [
            "What are the 99 other things on your bucket list ?",
            "“When I made my first million” .. sick to death of this TikTok hook . Show us your bank asswipe",
            "\"They’ll only care if you’re giving them something that improves their life, not yours\"\n\n\nThat's the entire point of business though? What kind of businesses have you tried? Maybe your issue is in the product or the methodology or the marketing. ",
            "Agree. People don’t give a fuck. You have to actually add value. Give the people what they want. \n\nAlthough it’s still possible if you get good at networking and sales and have a good product. \n\nPS I built a biz to $1M in sales in 3 years. So fuck you. Wasn’t easy but also wasn’t impossibly hard.",
            "Who hurt you? None of the people making money are lucky with some dumbass idea, writing some code, and a bit of marketing. They just executed like crazy while you weren't watching.\n\nEdit, to answer your question--\n\n>**Why the fuck am I doing this?**\n\nPersonally to create something that fixes the problem of people like me who have that problem. It's really THAT simple. Most successful businesses don't fall into any of your 3 categories of \"for money\", \"for passion\", or \"to chase a dream\", they fix a problem for people who have that problem and want it fixed. And it has been working so far for me so...I guess fuck you?",
            "[deleted]",
            "Welcome to the grown up world where you find the number 1 rule: People are selfish! Number 2; Built something that adds value to another and you WILL earn money.\n\nStart doing it only if it is your passion (or bucket list) and try to make money with it. If not, at least you liked what you did. \n\nToo many people burnt out because of only $$ but how you can manage that if you do not have any passion and continue to struggle after months and months of work",
            "It’s a good % of luck that your “passion” is something that is monetizable or underrepresented and/or needed. The other 95% is persistent forward motion. Just executing on a plan. People get tied up in the analysis phase, constantly trying to validate and overthink it. Thinking they need a MacBook Pro M4 because it’s faster and other nonsense. \n\nIt does come down to having a semi-decent, maybe unique, idea, and then executing fully on it to completion. That is the rarity of success.",
            "i approve this message..",
            "I believe in order to be successful, you should be willing to fail.\n\nI failed many times before finally doing things right. I’ve been homeless twice, made significant money only to lose it all a couple of times. Launched and failed multiple companies.\n\nI didn’t get any kind of support from family, friends or relatives. In fact they all advised me against starting another company, everyone in my close circle is risk-averse. \n\nCurrently have a company that’s doing very well.\n\nTry, fail, learn, repeat. Some people might get “lucky” and immediately get things right, but if you are willing to fail, learn and try again, it’s not a matter of luck, it’s a matter of time."
        ],
        "sentiment": 0.03328616522366522,
        "score": 543.3328616522366
    },
    {
        "title": "Idea to profitable saas app in 3 weeks - here's EXACTLY how i did it",
        "upvotes": 144,
        "num_comments": 105,
        "comments": [
            "Absolutely fantastic.  I got chills reading your post!  Tell us more about the crawler script - is it something you'd be willing to share?",
            "Wow, just wow.  Kudos to you!",
            "Congratulation! Your entrepreneur skill is so good so that you can find an opportunity to make money out of your idea. I joined your course a month ago on Udemy and I found that your teachings are awesome.\n\nI am also interested in web technology and now I'm learning PHP and MySQL to get solid foundation of programming. I like WordPress a lot and I hope to be a WP developer.",
            "Really like your approach here, with both of your apps! \n\nIt's great to see you sorting through which feedback to take on board e.g you iterated quickly on your script because you got a lot of requests for it - but you haven't been swayed to reduce your price because (and I agree) it's a fair price for those that need your podcast management. \n\nIt can be tough to know who/what to believe but you seem to know your own mind and have a great deal of focus. Also sharing your methods has resulted in you validating the need for another paid product which is a bonus! :)\n\nRegarding your price - I think $29 pcm is fine - if you do a weekly podcast and podigniter saves you an hour+ of time then that's well worth $7.50 - it can even add revenue to your bottom line when it remembers to bill sponsors on time! \n\nAs a pair of fresh eyes I have a few initial points of feedback - \n\n* **Branding Emphasis Needed**  The name (or a logo) needs to be more prominent to be memorable - if people try to re-visit at a later date as you add features they will have a hard time remembering your name & are unlikely to currently find you through search. \n* **Clarify Your Headline** - The phrase 'on top of' feels a little vague. 'Organize' or 'Automate Repetitive Tasks' are more powerful - your target market will identify with feeling unorganised or having to regularly do tasks manually\n* **Your Audience Is Split** - You have 2 very distinct markets, new & established podcasters. Brand new podcasters don't yet know the pain of podcast administrivia & may not instantly see the value. They don't yet have sponsors so signing up to any paid product pulls them further away from profitability. This crowd will tell you your product is 'expensive' when it's not. Established podcasters with high paying sponsors would probably pay 10x your price but may be too set in their ways to move over to a new service. They may demand more features as they attempt to completely replicate what they do themselves. If you're aiming for 'easy to use' avoid adding everything they ask for. Be mindful of which audience you are writing your copy for. \n* **Social Proof** - Getting some known podcasts using this service would a huge credibility indicator if you could put their logo on your site. Their mentions would be great advertising at $0/little cost.\n\nI know it's early days & you may have all of these ideas & possibilities in mind anyway - write them all down & any one you find yourself writing down multiple times are obviously have recurring needs. \n\nLooking forward to hearing how it progresses for you over the coming months! ",
            "Hi, any good courses on coding/building a MVP that you would recommend? :)",
            "Good work and good luck!\n\nWhat kind of tech are you using?  I'm becoming a bit disappointed with the stack I chose.  My to-do list has about 20 things left, so it's a little late to switch to a different stack.  But some of these things are solved problems in other stacks.",
            "Well done. I've rebranded and relaunched my business and looking for ways to reach out via twitter. I really like what you are doing re:twitter crawling, and wanted to ask as you seem to have a bit more knowledge in it than I do, but can your crawling script also take into account location ?",
            "Awesome stuff man. Could you share the script or the sentiment analysis libraries with me? Thank you. ",
            "Awesome.  Thanks for sharing!",
            "Great job man!\n\n\nMy day job is a marketer for IT stuff, and if anyone here is in need of another idea for their next business I highly recommend getting into cloud-based services. Companies left and right are moving towards embracing consumerized mobile computing and are eating up these kinds of cloud services. "
        ],
        "sentiment": 0.4186876717485413,
        "score": 397.1868767174854
    },
    {
        "title": "Validating a SaaS idea and pre-selling licenses at €3k each - The SaaS to make your site load in under 700ms",
        "upvotes": 13,
        "num_comments": 65,
        "comments": [
            "The idea is good, but I'm sceptical that you can keep that promise of guaranteeing a loading speed of <=700ms (or any fixed number) from a technical point of view. Loading speed depends too much on implementation details of individual websites and hardware. How do you guarantee, that a complex query on a database is executed within a fixed time intervall without having any sort of constraints?\n\nEven if you limit yourself to a certain plattform (e.g. WordPress, Magento) you will struggle with plugins and other corner cases.\n\nWhat will happen if you take all that money upfront and fail to deliver?",
            "You're calling it SaaS but you're just building a CDN with setup fees.",
            "You already have competitors in this market (WordPress optimise and cache) from Jetpack and Litespeed cache\n\nHave you checked their offerings to see how yours is different?",
            "Can you definitely build it?",
            "If you can get customers to pay for it then it’s hard to say no. I would though also see if you can get any customers that you don’t personally know as well. To do this I would create a landing page and try to get some signups/emails from those who are interested. If you can get others you don’t know to pay for it then you’re in a much stronger and safer position. I wish I would have spent more time validating some of my ideas before building them.",
            "\"Optimize it\"? Please explain in detail how you do so. There are many, many different things that go into page load time. Is it a case by case technical Optimization? Or actually a SaaS product. I understand the value prop, and am very interested, you would have a recurring customer with me. IF you can break down in detail how you're doing this.",
            "A Simple google cloud computed render of html right? Smart.",
            "[deleted]",
            "Its simple, offer a free 7 day trial and guarantee 95%+ times 700ms- load time and if people are satisfied they will pay.",
            "The spinner will load in under 700ms"
        ],
        "sentiment": 0.07657142857142857,
        "score": 91.76571428571428
    },
    {
        "title": "Building a SaaS from an idea to a fully working MVP in 30 days. Sharing the entire process (design, branding, development, marketing) in public.",
        "upvotes": 29,
        "num_comments": 16,
        "comments": [
            "I love the idea. Well done, very cool. I will be sure to follow to process. I can relate to this. I just send you a message lets talk more.",
            "Interesting idea. Is Twitter the only place to follow or are you planning on doing like a newsletter or some other medium to follow?",
            "This is cool! Would be interesting to also follow the journey after the 4 weeks. Curious to see what decisions you make when building your first team, scaling commercial operations etc",
            "Congrats--this is awesome!",
            "Great idea. Will be sure to follow along!",
            "Would love to know more",
            "Can I work for you for free in london?",
            "Thank you and happy to chat :)",
            "For now only twitter probably as it makes it easy to post daily updates.",
            "Thanks :) We definitely have some plans for marketing as well that we are going to share along the way."
        ],
        "sentiment": 0.44715277777777784,
        "score": 78.47152777777778
    },
    {
        "title": "2700+ SaaS Ideas, 700+ Directories, 60+ launchpads, 180+ Newsletter, 500+ SaaS Tools in one website. My 2nd project as Entrepreneur",
        "upvotes": 15,
        "num_comments": 26,
        "comments": [
            "UI is awesome 🔥\nCollection is great too",
            "I love the UI, and if i am not wrong it resembles another website alot in terms of ui, i cant remember its name",
            "It's pretty cool",
            "It's pretty cool",
            "great web",
            "Okay, this is actually good and easy to navigate. Unexpected, nice job!",
            "👌 ! Keep going:)",
            "Very useful thanks!!",
            "[removed]",
            "Nice list, why don't you have save ideas or search ideas feature?"
        ],
        "sentiment": 0.46229166666666666,
        "score": 60.62291666666667
    },
    {
        "title": "Roast my new SaaS idea",
        "upvotes": 11,
        "num_comments": 26,
        "comments": [
            "Delete the post and go build it. Sounds amazing!",
            "I run a software agency so probably your target market. This is interesting. I think there would be a market for it. I don’t think I would use it myself though.\n\n- I much prefer GitHub, and you can use it for free if you don’t need fancy features\n- Google Workspace is cheap per user and gives you social sign in to other apps. You can even do it for free by using personal email addresses until the project takes off.\n- anything technical (user auth, db, whatever) using the native solution from the cloud vendor is my go to. I.e I wouldn’t want any technical decisions made for me. You can get pretty far even with the free tier, especially if you choose serverless technologies\n\nI like where your head is at. There is too much friction between writing code and running a business with it.",
            "Why is the price so low? If someone is starting an app, side project, etc. I assume they want to make money from it, making this sort of B2C and sort of B2B. $10/month is less than a Netflix subscription, if someone is somewhat serious about their new project, surely they'd be willing to pay more than that.",
            "You should allow two domains, one for public facing entry, the other for internal systems. The reason is that all of those private and sensitive systems should not be discoverable via DNS look up of your public app domain.",
            "I have a few questions because this is super interesting. I think your price point is a little low if I understand what you're providing. \n\nAre you providing the VMs?\nAre you patching and maintaining the VMs?\nAre you upgrading the apps put in place? \nAre you providing support? \n\nI think it would be great, and I would enjoy a conversation on this topic.",
            "Love the idea! Few questions: how come the VM is so cheap (3$)? will you offer different programming langauges? could it be that that one VM is not enough for large userbase? Also agree  wiht others that the price is to low.",
            "But like, what about the app subdomain?\nWould you have the possibility to choose an \"app starter script\" or a Docker image or maybe start from an existing git repo as a template?\n\nCause like, what if I wasn't a NextJS app, but someone would maybe want to start with a Sveltekit app, or I may want to start from my own react template that includes my fave state manager and whatnot?",
            "Doesn't supabase basically do all of this already?",
            "Damn for reals? Would people pay €25 a month (or €100 a year up front) for this?\n\nWhat are the top/first 3 things people would want to see?",
            "This"
        ],
        "sentiment": 0.20241061121418266,
        "score": 50.02410611214183
    },
    {
        "title": "Bored,Tell me your app/platform/saas idea and I will give you plan on how to start",
        "upvotes": 11,
        "num_comments": 25,
        "comments": [
            "[deleted]",
            "I don't know what I really want and what will be better. I have 3 ideas of projects:  \n1. Shooter game on Roblox with monetization  \n2. App with tracking management features on IOS/Android  \n3. App with AI assistance, don't know what it will be and how it will be looks like, but i think it will be app with CV features.\n\nalso, for now I am writing and Research in my university, and I want to build an system for teachers and students to optimize education processes to make it more easier to use phones in study. This app should optimize time management, resources access, and communication in groups, fast notifications. \n\nI think that app for university is the real one goal that can be implemented, but I want brainshtorm this idea.  \nWhat you can say about these ideas?",
            "I'm creating a tool, for let's say a teacher, to write questions and generate similar problems so their students can practice for however long they need. It's been harder to do than it looks with AI since you cannot trust them with the maths when a problem requires a solution with multiple steps.",
            "Well I don’t necessarily have an idea but I need help with choosing a suitable model for my current situation. I am currently a full time university student and am working a casual position working only about 4-14 hours a week. I am hoping for something that can be managed anytime and with flexible schedules.",
            "I built a tool that allows people to extract components or sections that they see online and creates an easy to use starting point template(HTML and CSS) so it can be used right away. I created this for my own workflows when I was manually copying CSS from websites(which would take hours).",
            "AI app to connect with selfie or some proprietary hardware integrated portrait photo to right clothes fit and integrate across brands and make recommendations based on style fashion and personal preferences. It's your AI wardrobe buddy. Also helps with clothing choices based on your own inventory.",
            "Invoice Factoring for B2B, loans for B2B to purchase inventory, etc",
            "Tinder for fashion + quick commerce delivery",
            "Co2 cnc cut mdf products manufacturing.",
            "Can I DM for that"
        ],
        "sentiment": 0.12136904761904761,
        "score": 48.21369047619048
    },
    {
        "title": "I have a Saas idea for the construction industry but no idea how to code….",
        "upvotes": 4,
        "num_comments": 38,
        "comments": [
            "I advise tech services companies and off-hand I can tell you that you'll be able to find a great agency that can get your app built for 20k. That's not the problem. The problem you have is that the asset you have is: \"Relationships with executives, directors and decision makers of said industry.\" and you need to convert this asset into sales. Product development happens with the customer. You need the customer first. So you need to think about what is the minimum thing you can sell to said executives, directors, and decision makers today, or well at best literally next month. \n\nMaybe the burden of switching to your platform is too high and you need to create a plugin for their existing platform. Maybe your app vs is a Trello plugin. Maybe you need to sell it as IP-backed consulting. I don't know. But unless you know what you're selling don't bother writing a line of code.",
            "I think you should learn the No code tools it will merely take any time and you can do it on your own. Either go for No Code tools like Bubble or AI agents like Cursor, Bolt or Lovable. They are insanely awesome.",
            "Have you done \"back of the envelope\" financial projections?  Figured out how much money you can reasonably expect to make - and compared that with the cost ($5K? $20K? $100K?) or developing your service?   Let's say you can get everything working for $50K.  Is the income going to surpass that? \n\nIf you are CERTAIN  - then:\n\n\\- Draw pictures of the APP, make a presentation, and go show it to a couple of potential customers.  Tell them you are NOT trying to sell this to them. Just wanting their input on your idea - and then ask them what it might be worth to them (monthly, yearly, whatever).  \n\n\\- Adjust your economic projections based on their answers.  Maybe you over/underestimated the value of your idea.   (And you said it is a \"local\" idea... which I assume limits it's value.  If you can re-purpose to other \"local\" areas, obviously that greatly increase the value of your service. \n\n\\- If it's still worthwhile based on above, then write up a \"technical\" document that explains exactly what the service is (page 1)... and how the software/service would work.  I.e, show every screen your users would see, and explain to the computer programer(s) exactly what each screen and each button would do.  Draw pictures and notate them with arrows to each button, etc. \n\nYour software development costs increase with complexity.  E.g.,  if you have different levels of users (Admin, super user, basic user) that is more complex than a \"stand along\" system with only one type of user.  \n\n\\- Take your tech doc and find some developers to talk to.  Their pricing will be all over the place.  Make sure they have working examples of their work that demonstrate they know how to do what you need.  (E.g. Do you need 3 types of users? Have they done something with different types of users?)   If you go to them and say \"I need this (pointing to tech doc) can you do this?)\"  - you can figure out which can or can't do the project - then ask them to give you a price and a timeline.    (To be fancy you could turn your tech doc into a \"request for proposal\" (RFP) and send that to your candidates)",
            "What aspect of construction industry?.. Actual construction? Or something that supports it (logistics, inventory management)",
            "Design everything about the software. Use pen and paper or get fancy and use figma. Try tools like Bubble to do an MVP. Find coders on fiverr or upwork.",
            "Consult me - [https://www.linkedin.com/in/kodeeswaranp/](https://www.linkedin.com/in/kodeeswaranp/)",
            "Sent you a dm",
            "I worked with a great dev to build out the MVP for my product. They use an app-building platform spiced up with custom code where necessary. It's working great and my beta program is prompting some minor changes that are easy to tweak. It's been exceptionally affordable, I won't share the price because that highly depends on complexity, but I got a quote for $120,000 for the same functionality which is insane (for my stage). \n\nConnect with them here: https://kealy.studio/\n\nBut I'd do everything you can with the tools you already use. The more you can get into an excel document or Airtable, graph paper etc will speed things up. That process helped me find some significant gaps in my idea before they were developed.",
            "Software can appear simple but end up being massive hidden features. Feel free to ask me any coding questions. What's special about your software that others can't do? Which ones have you looked into?",
            "Man, there are a LOT of startups in this domain. I know startups, software for middle companies, and big companies have their own systems.\n\nYou have to search if you have a true differentiation, know who is your target niche, test with prospects..."
        ],
        "sentiment": 0.15863690476190478,
        "score": 47.586369047619044
    },
    {
        "title": "Quitting my job to pursue my SaaS idea",
        "upvotes": 8,
        "num_comments": 20,
        "comments": [
            "[removed]",
            "Congrats on taking the leap! Validate your idea with potential customers ASAP.",
            "Bold step man but congrats and good luck but bootstrapping a new business and growing it to a sustainable level is hard, because it takes a long time and it requires mental and emotional endurance. And luck.  \n  \nTrying to do that without some financial foundation will make that 100 times harder.  I managed to grow my business to a good ARR while having a part time contract job. Having stable income is so crucial to how I attacked new products/ideas because If they failed, it didn't matter. Patience.",
            "A great recipe for bankruptcy.  Validate your idea first.\n\nThe elderly spend less on digital products than any other age bracket except for infants.",
            "Remember that it takes time for money in to transition to money out. That’s something that can really slow the process or if you’re not careful, ruin momentum",
            "Why? You haven’t built the product yet?",
            "You're asking such basic questions... that your chances of success are minimal - \n\nnot that your idea isn't good - but if you have no marketing experience (trial and error, etc) or havent been already exposed to the tumult of success and failure of entrepreneurship then good luck. \n\nHave you done any market research to see if your product even exists and why and why not it has worked or hasn't worked?\n\nHow much will businesses buy it for? \n\nWhat's your data requirements, encryption, scalability, support? IT requirements. Who else is in this space? \n\nOff your cery limited post, youre either /s, naive, or have an Ace up your sleeve youre not sharing. Because initial impressions are tgat you are driving down the highway with your eyes closed singing \"weeeeeeeee I love driving so I'm going to make it!\"",
            "Dont quit, hire a HQ developer for the same price you are earning. And have him do all the tech work while you manage the rest during your free time. If things woek out quit your job and pursue the project further. If it doesnt work you still have your job so you didnt lose anything.",
            "I do business funding. Find me on insta I would love to connect",
            "Well I think you need to build a physical product to validate your idea with and the platform suggested here is a good place to start. WHen you build something you can use that to validate your idea, get a feedback, and then use this to build an MVP as suggested above."
        ],
        "sentiment": 0.10862740962740962,
        "score": 37.086274096274096
    },
    {
        "title": "How do you find ideas for a SaaS or an online business and turn them into a real business?",
        "upvotes": 7,
        "num_comments": 19,
        "comments": [
            "Search communities like discord or reddit (teehee) for subjects you are interested in. Get involved with them, spend a day with each community learning to understand what they're about and what they go through on a daily basis.  Identify a need, come up with a solution, and capitalize on it.  The most important thing is not wasting time doing things that aernt getting you closer to your goal.  Take the first step now, and then after that take the next step. \n\nIf you want to move forward, The worst thing you can do is stand still.",
            "I’m in the literal opposite position. Long list of viable products/models and adding often. Trust issues so I do everything myself, teaching myself the technical stuff. Snails pace on a project or two at a time and an existence of constant fomo/impatience",
            "This is sick how many people have the same problem with ideas.   \n  \nThat's why I started [the newsletter](https://theopportunist.co/subscrube) about emerging business ideas (and for myself as well ). Here are some grabs from my finds that might inspire you:\n\n**1. Virtual Wrench**  \nGot a car issue? Who needs to get greasy when a virtual mechanic can diagnose issues in their PJs?\n\n**Why now?:** The gig economy is thriving, and with platforms like JustAnswer booming, this innovative idea taps into a very lucrative and growing $500 billion gig economy market.\n\n**2. Real Estate Crowdfunding Platform**  \nTurning every couch potato into a landlord without the hassle! Crowdfunding as an option for those who want to brag about their real estate prowess without actually doing anything.\n\n**Why now?:** Given the inflationary environment and increasing interest in real estate as a hedge, collective investing platforms are gaining attention. The global real estate crowdfunding market is expected to grow at a CAGR of 58% by 2028.\n\n**3. EcoInsurance**  \nInsurance that actually wants to save the planet, rather than just ignoring it.\n\n**Why now?:** With biodiversity and climate crises looming, companies are starting to realize that eco-friendly is not just cool, it's necessary. Particularly with $20 billion annually needed to combat biodiversity loss globally.\n\n**4. Deepfake Defence Force**  \nProtect the world from cyber-fakes with a SaaS solution detecting AI-driven deepfakes. It's like having your personal Sherlock Holmes, but for the digital age.\n\n**Why now?:** Internet scams leveraging deepfake technology are on the rise, taking advantage of increasingly sophisticated AI tools to deceive people on a massive scale.\n\n**5. AI Powered Restaurant Management System**  \nWhy rely on humans when AI can handle restaurant operations? Revolutionize dining experiences with a digital butler.\n\n**Why now?:** Post-pandemic, restaurants are embracing tech like never before. The global market for restaurant management software is set to grow by 14.3% annually.\n\n**6. Single Parent Match**\n\nThis dating app is specially designed for single parents juggling kids, work, and finding love. Because you shouldn’t have to choose between finding a soulmate and finding a babysitter!\n\n**Why Now?**: The single parent population is growing rapidly, with over 11 million single parent families in the US alone. Traditional dating apps often overlook the unique needs and challenges faced by single parents.\n\n**7. Digital Safe space for Teens**  \nCreate a digital platform offering safe, moderated chat rooms and forums where teens can discuss mental health, academic pressures, and everyday challenges anonymously. Picture a space where teens can vent, share memes, and get support without worrying about trolls or oversharing.\n\n**Why Now?**: The mental health of young people has been significantly impacted by the pandemic, with rising rates of anxiety, low mood, and self-harm. A digital safe space can provide crucial support outside of school hours .\n\n**News Trigger**: Antidepressant use in child mental health services increased by 44% in the last decade",
            "Talk to people",
            "B2B is tricky. Unless you find someone—a co-founder or employee—who can handle the business logic, design, and other aspects, it will be really hard to make progress. Additionally, B2B selling is even more challenging. You can create a great product, but unless people trust that you know what you’re talking about, selling it will be very difficult. The best approach is to find a business partner from a different industry who is highly skilled or has strong connections in that field. With the right partner, you’ll have a much better chance of success.\n\nB2C isn’t my strongest area. It’s probably easier to develop a tool by exploring the internet for ideas and problems, but selling it is still extremely hard unless you really know what you’re doing and have a substantial budget for marketing.",
            "In my case, it started with my own frustration of organizing so many chat conversations with chatgpt, claude, and perplexity. So I made the extension https://ring-gpt.com out of my own boredom and laziness that has now paid customers. \n\nNot too much money, but still enough to validate the idea. Keep looking for paint pants that you encounter and see if you can make something useful around it.",
            "If you are not having a million ideas a day and lack time to do them all this is not for you.",
            "Try solving a problem you are facing",
            "I'm here to help you all the way!",
            "You can start by looking for challenges that people are facing in industries that you're familiar with. You can post questions like you just did in relevant subreddits or Facebook groups to see what pain points stand out the most and then research to see if any solutions to those challenges already exist."
        ],
        "sentiment": 0.11789047619047618,
        "score": 34.17890476190476
    },
    {
        "title": "If you have an SAAS idea, but you dont know how to code, what would you recommend?",
        "upvotes": 3,
        "num_comments": 20,
        "comments": [
            "Start by validating the idea, meaning, customers that will pay to use the product. No sense in pursuing an idea that no one will use. Even if it’s not built yet, set up a simple land page showing what your idea will solve.\nAnalyze how many people sign up and want to be reminded with updates about the solution. Then if that pans out, you could hire to get it built.",
            "Have an idea? The first thing is to validate it. Build an audience. You could easily launch a website in a day with webflow or wordpress. Just have a waitlist form there.   \n\n\nOnce you have a big enough audience resonating with your idea, that is when you should go about building the product.",
            "There’s lots of no code tools available that you could research to see if they meet your specific needs.",
            "Look on Upwork for someone to do it for you on a contract basis. Create a \"Request for proposals- contact for NDA\" Get a nondisclosure agreement signed before sharing the description and ask for a proposal. They should give you a timelines, and price (specify this in your Upwork post).",
            "Hire someone.  \n\n\nI always hire some people in my network to do side ideas I don't have time for. Helps keep the equity for me. I usually prefer employees not partners, so I usually go that route. Also do it for sales, marketing etc.\n\nI hire outside of the US, so it's cheaper, and the quality is there. Takes a bit of time to vet but I turned it into a process, and my engineers currently vet other ones.  \n\n\nAnother take is always make sure they are working FT on this (if it matters to you). I prefer having 8 hours of communication and work I can discuss at anytime with my team. Being a gig does not cut it for me.\n\n&#x200B;\n\nDM me if you have any questions",
            "I don’t mean to be a stick in the mud but there’s not much you really can do. Most Saas’ require not only the upfront coding but the upkeep. And you need to know what it is you want and what you’re asking for, as well as how that corresponds to programming. You also need to maintain it. So you would have to hire people for the upfront, then hire people to maintain.",
            "Get a new idea",
            "You mean to distract myself from realization of just who contributed to my dysfunctional relationship with money where I can't hire?\n\nI would call out, in a clear forceful way: \"Eighth Grade Student Homework Powers ...ACTIVATE!\" Then -- as if by magic -- I'd just grok how the people on this planet come to know, oh ... all manner of impressive things.\n\nBut I digress ... we were discussing *your situation*.\n\n&#x200B;\n\nTIL The singularity is at hand. Just not the one I was looking forward to.",
            "Try bubble.io. Or, find a co-founder who does know.\n\nOr, spend the time to acquire the skills you need.",
            "Validate the idea, get money, hire a dev"
        ],
        "sentiment": 0.11219886363636364,
        "score": 27.121988636363636
    },
    {
        "title": "Technical founder looking for someone with a promising SaaS or Idea to be his technical co-founder",
        "upvotes": 3,
        "num_comments": 17,
        "comments": [
            "What industries or vertical are you looking to get into?",
            "I have same background I suggest you watch this video, also see 'TK Kader' yt channel  \nhttps://www.youtube.com/watch?v=-Marj9F-xvw",
            "How is your English speaking skills? If you can speak English also, you're a unicorn.",
            " Have you tried YC cofounder matching?",
            "Technical founder looking for a technical founder?  Really bad idea.  \n\nFounders should recruit the opposite of who they are.  Technical founders need sales people.  Hire not in your own image.",
            "Will DM you when I get a chance",
            "Having two tech co-founders on board is not the best option. Perhaps you should find someone with more business-related acumen with experience in sales, marketing and product. It's essential to combine these two things when exploring product-market-fit opportunities. You guys should complement each other instead of being the same :)",
            "OP, sent you a chat.",
            ">Code/low-code tools\n\nBest question so far. I'm open to any industry, but I prefer: Code/low-code tools, eCommerce, automation, and IoT solutions.",
            "Thanks for sharing"
        ],
        "sentiment": 0.08625000000000001,
        "score": 23.8625
    },
    {
        "title": "Any saas ideas ?",
        "upvotes": 0,
        "num_comments": 23,
        "comments": [
            "There was a dude who was selling a list of SAAS ideas and his methodology was pretty interesting: he went to the forums of popular services that people use like Shopify, etc. and then he just ran a search for posts that mentioned \"hate\" or \"problem\" or \"struggle\". You could do the same even in subreddits here.\n\nIf you can't find other people's problems or examples of them in your own life, I'm not sure that randoms on Reddit are going to hand over juicy ideas. Because they'll want to solve it themselves.",
            "I’m personally not a fan of gpt wrappers. I try to focus on stuff that can’t be done with gpt wrappers.\n\nIn terms of ideas, just read the news and you’ll see all the different problems that exist in this world. Pick one, and create an SaaS to solve that problem",
            "I don't think you need to be very creative to recognize a problem exists, perhaps in solution finding -- but It's less some flash of brilliance than simple research and diligence. Because it's work, the people trying to get out of work go nowhere.\n\nSome version of this question is asked every few hours here. [What Are Your Tier 1 Problems?](https://www.reddit.com/r/Entrepreneur/comments/94qdvy/what_are_your_tier_1_problems/e3n07ve/)\n\nOne idiot got all bitchy and whiny because I didn't update that massive list of lists. He missed the point. If you can't use a scrollbar or a search engine -- if you can't figure out the news is about nothing but problems -- you have much bigger problems.\n\nI figure people want the billion-dollar problem or product idea it takes almost no thought to solve and develop. That's a head-scratcher.\n\n[Problem Curation](https://www.reddit.com/r/RoastMyIdea/comments/j7kar8/problem_curation/) is something I wrote because newbies are as bad at selecting the right problem to solve as they are everything else.\n\n[Blue Ocean Tragedy](https://www.reddit.com/r/RoastMyIdea/comments/dd4rce/blue_ocean_tragedy/) is a post about people reading the wantrepreneur myths into everything they read, bastardizing the concepts and twisting the instructions beyond recognition.",
            "I’ve had the idea of making a software that allows you to upload to multiple channels all at once, YouTube, TikTok, insta etc.\n\nAll the video editing, and uploading in one place might be a hit? If there isn’t something already out there",
            "Everyone will tell you to create an **'AI' SaaS** (related to the OpenAI API).\r  \n\r  \n**I advise against doing that**. There are thousands of SaaS using the API, and your SaaS will just be one among 20,000 others. You might get 200 visitors and zero MRR (speaking from experience).\r  \n\r  \n**I suggest finding a niche and identifying a pain point:**\r  \n\\- Your SaaS should either:\r  \n  1. Make users money\r  \n  2. Save users time\r  \n\r  \nIf your SaaS doesn't meet either of these criteria, forget about it. If it meets both, then it's a jackpot!\r  \n\r  \nGood luck,\r  \nToma 🙌",
            "[deleted]",
            "Make an ai watermarking tool , for digital files like photos, PDFs and videos, etc. watermark can be seen but can't be removed with some security.",
            "Hey I’ve got two financial platforms that could use a saas product",
            "The thing is , now adays problems aren't the top money grabbers , tiktok for example , it basically worked because of entertainment , the algorithm is so addictive , so it works on the having fun emotion (basically dopamine), maybe if we worked on another emotion it'll grab people too",
            "Same im trying so hard to escape gpt wrappers i almost made my own social media where users can have meetings with popular rich people for a fee 😂 basically a platform just made for meetings , a platform with a price tag to book a meeting with this person irl or online , the only problem is why would rich people use my platform in the first place 😂"
        ],
        "sentiment": 0.08361871693121693,
        "score": 23.83618716931217
    },
    {
        "title": "If I can't code, is white label SAAS a good idea?",
        "upvotes": 2,
        "num_comments": 17,
        "comments": [
            "Why would someone buy it from you rather than the original white labeler?",
            "Depends on what you plan to do with it. \n\nWhite label works well if you offering a suite and its a part of it. Or as a starter for later getting an eng team and grow in that domain.\n\nIf you are building your company with the assumption you buy it and that is it. I wouldn’t recommend it",
            "Generally you pay a subscription and then the provider will host the solution for you. The benefit of this is that they will do all of the ongoing support, development and maintenance work. The downside is that this means you (and your clients) are effectively locked in to that product.",
            "You are merely a reseller.  I am not sure what you mean by have my saas released to me? It is their saas not yours. You will never be free and clear.",
            "Yes - but it would have to have certain modifications/extensions that are unique to you to make sure the customer doesn't go directly to the white labeler.",
            "*Would I be locked into them forever*\n\nThat depends on the terms of the contract. Be aware though that you'd still need a coder to customize it and add new features down the road.",
            "No, you will never be able to just buy your saas from them. At one point you would have to get your own developed. But i guess it is a good start.",
            "Yeah, white-label SaaS is a really good option if you can't code, because it lets you resell a product that's already been built without having to do any software development yourself. A good example that I have come across is My AI Front Desk where you can just rebrand their AI-powered customer service solution and start offering it to businesses right away, without having to worry about any coding or technical setup. A lot of white-label SaaS providers give you some flexibility when it comes to ownership and control. If you ever want to switch things up or customize the software more, they can give you options for that. It’s a perfect solution if you want to get started quickly and focus on marketing and sales while using a product that's already up and running.",
            "Marketing",
            "I assume the original company is marketing their solution to the problem also? So you’re competing with them and they actually own the product. Seems like a difficult position to me. Not one I’d really want to get myself into.\n\nBut I suppose people sell tons of products they don’t personally manufacture/create, so I guess it could work."
        ],
        "sentiment": 0.1827514258228544,
        "score": 22.827514258228543
    },
    {
        "title": "Validate an idea for me, a website where SaaS products can get attraction through competitive user feedback",
        "upvotes": 4,
        "num_comments": 5,
        "comments": [
            "This seems kind of like some of the existing launch sites (PH, HN, etc), but a compelling hook could help gain momentum. I’ve read that the existing launch sites are somewhat stale due to saturation.",
            "[deleted]",
            "I’m thinking that the feedback and prize aspect will separate it from sites like product hunt.",
            "Thanks I have actually done all of them and there are positive signs.",
            "I think it’s an interesting concept! I’ll be following for sure",
            "Great to hear."
        ],
        "sentiment": 0.2310290404040404,
        "score": 15.310290404040405
    },
    {
        "title": "Seeking Advice: how to validate your B2B SaaS idea?",
        "upvotes": 3,
        "num_comments": 7,
        "comments": [
            "[removed]",
            "make a google form with relevant questions and post it on linkedin. You may get nice volume of data",
            "Validation means different things to different people.  But generally speaking show the product to as many people as possible and then get feedback.  Sometimes you can also do general research to know if in fact that there is a demand in an industry.  Sometimes its much more difficult to tell and you have to do alot more customer feedback and validation sessions.",
            "Hi,\n\nMaking sure your B2B SaaS idea is good before you start building it is really important. It can help you save time and money. You wonder if you’re being too careful by not talking to people until you have something to show, but I personally think getting feedback early can actually be super helpful. \n\nIf you talk to a few people you trust, they can give you good advice without you feeling like you’re using up your contacts. Just let them know you’re looking for feedback, not trying to sell them anything.\n\nIf you’re thinking about reaching out to people you don’t know to get their thoughts, that can work too. You can make a quick survey or talk to people to see if your idea makes sense to them. \n\nYou can also try some other ways to check or see if your idea is good. \n\nFor example, you can make a simple web page that explains your idea and see if people sign up for updates. This can show you if people are interested. If you have time, making a basic version of your tool can help you get feedback. There are tools that let you make a simple version of your software without needing to actually code it.\n\nRemember, this advice is coming from someone who’s really good at launching Private Label (PL) products on Amazon. So if you want more information about PL, just let me know!\n\nThanks",
            "You're not being too cautious. Your network is valuable, and you're right to save it for when you have something concrete to show. Don't burn those connections on early-stage validation.\n\nCold outreach can work for idea validation, but it's not great. Here's a better approach:\n\n   - Use LinkedIn Sales Navigator to find people matching your ICP. Send InMails (not DMs).\n   - Export that list to a tool like Apollo or RevenueBase to get their email addresses.\n   - Clean the list with Reoon to remove bad emails.\n   - Use an email outreach tool like Smartlead to send personalized cold emails.\n   - Keep your daily send volume under 30 per email address for good deliverability.\n   - Offer something valuable in exchange for their time (industry insights, gift card, etc.)\n\nYou don't need hundreds of responses. Even 20-30 good conversations can provide solid validation. Once you have a demo, then leverage your network for real deals.\n\nSource: I run a B2B email outreach agency (OutreachBloom)",
            " yeah man, definitely tap into your connections. they could give you some real insights without having to build a whole demo first. keep it casual and ask those questions you mentioned; that way you can gauge interest and tweak your idea before you dive in deep. use their feedback to shape the tool – it’s all about aligning with what people actually need, ya know?"
        ],
        "sentiment": 0.15560643060643062,
        "score": 14.556064306064306
    },
    {
        "title": "I want to validate my ai saas idea",
        "upvotes": 2,
        "num_comments": 8,
        "comments": [
            "How are you going to put food on the table?  How are you going to build a team to offer support or improve the service?  When LLM providers drop their cost even more and [Bolt.new](http://Bolt.new) drops their cost, what's your competitive advantage? Costs are falling everywhere in AI. This is a losing strategy.",
            "[removed]",
            "I used to run an incubator for 7 years and I never saw a startup succeed with a \"cheapest price\"-strategy in the tech space. You should probably try finding an area where you can be good in another way, or do what [bolt.new](http://bolt.new) does but in a niche and with other features. Good luck!",
            "You can try buildglare.com，The price is cheap, and the form function can also be installed and used with one click.",
            "Nice buddy, but in the announcement bar you say first 100 projects free, and just below hero section, you show 500+ active projects. BTW thanks",
            "Correct, looking to add some extra in demand and useful features",
            "Yeah, just don't compete with other players in a feature race. [bolt.new](http://bolt.new) isn't the only one out there, the space is already crowded (lovable.dev being one other)."
        ],
        "sentiment": 0.24476190476190476,
        "score": 14.447619047619048
    },
    {
        "title": " 150+ paying customers and $1k+ MRR -- Roast my SaaS idea ",
        "upvotes": 2,
        "num_comments": 8,
        "comments": [
            " You should add equity as an option for compensation. And then market to influencers. I bet they would love having a piece of the pie.",
            "Are you looking for someone to help you get more sales?",
            "Oh god, you again. \n\nWhere to begin? It's like someone took every cringy buzzword in marketing and decided to throw them all into one bland, uninspired website.\n\nThe concept of using AI to spam Reddit users with \"hyper-personalized\" DMs sounds like a fast track to getting banned. Claiming to reach \"100x customers\" and \"10x reply rate\" is like promising a unicorn in every backyard. The site design? It's about as exciting as a spreadsheet. And let's not forget those \"viral posts\" – as if AI can magically conjure engaging content from thin air.",
            "Sure, what's your proposal?",
            "If not all your comments were same for everyone, I'd take them seriously 😂😂",
            "Been in sales 10 years. B2C and B2B. You mentioned your bandwidth is low for prospecting. It’s what I do and love. I’ve got a few industries I think this would work very well in. If you want to discuss something shoot me a dm",
            "Kiss"
        ],
        "sentiment": 0.21785714285714283,
        "score": 14.178571428571429
    },
    {
        "title": "Is SAAS the best entrepreneur idea?",
        "upvotes": 0,
        "num_comments": 11,
        "comments": [
            "Ah, the perfect startup recipe: no code, no money, no business plan, no customers. You're essentially a stealth mode startup so stealthy, even you don't know what you're doing next. Congratulations, you've achieved ninja level in entrepreneurial mystery!",
            "The entrepreneurial bug has bitten you. Welcome to the SaaS dream. A couple of problems you may run into early that I want to warn you about:\n\nYour product development overhead may be low but you'll have to deal with customer support, bug fixes, deployment issues, server cost if your product does well, marketing etc.\n\nWhen you hire a developer or a team of developers, you need to retain them for the long term. You're product is going to go through many different iterations before you find product market fit and the speed at which you need to iterate in order to capture the market needs to be there. This will cost you more than having a technical cofounder.\n\nFinding a developer is easy. Finding a good developer is hard. Finding a good developer who cares enough about the product to move fast enough...\n\nSaas isn't going anywhere. With the help of no code tools and AI, you can build an MVP and validate your idea. And you can learn how to code and build out your project at the same time.\n\nGood luck to you",
            "Yep, come up with some ideas, test them all out by seeing if anyone is interested. Get a list of users that are interested and find a way to connect with people to pitch to them. \n\nYou don’t need to know how to code, honestly that will delay you more.",
            "I come from a software background. And I'll give some counter intuitive ideas here I have learnt the hard way. \n\n1. With saas and software it is very easy for someone to copy you and build what you have so unless you really have a technical advantage, most saas businesses are not successful. \n\n2. You need to catch a wave + do something naughty. Most of the big startups you know like Amazon, Facebook, Google, Snapchat, YouTube all did morally questionable things early on to corner the market (which later got revised out of history) and they started when the internet was just getting popular. \n\n3. Saas has become more popular in the YouTube business education space because no code tools have become better + chat gpt etc. However, this also means that competition has increased massively. And as an insider I can tell you that the saas wind deep in the tech world is already slowing down. People are tired of subscriptions. \n\n4. Selling saas is hard. Explaining what your software does is  not easy and it can be hard to translate the value of your software into your clients minds. Especially if they are non tech. \n\n5. Finally you have to stare at a screen everyday for a long long time. Many people underestimate this. Yes you can hire etc but you would still have to spend quite a bit of time staring into a terminal especially if your software is successful. \n\nIf you are in an area like silicon Valley with good university pedigree, joining an accelerator like YC and doing a saas is worth it. Or if you know investors and can get funding then go ahead. The playbooks are written and quite clear. Such as b2b saas for example. \n\nBut if you really like business and are interested in building the future, sell things people need. Shoes, houses, clothes, fitness, health. People will always need these things. And you don't have to sell them. They know what these things are. So you just have to tell them what's special about yours. \n\nHaving said all this if your heart tells you that programming is what you're passionate about, disregard everything I said and get going.",
            "Hey! I'm starting a \"Tech co-founder as a Service\" company and think there's a good angle to work together. Would be keen on having a quick chat. You down?",
            "You're clearly not crafty enough to get by and pull a fast one either. And \"best\" according to who? ",
            "\"once it's built it has very low overhead.\"\n\n  \nHahahahaha. Customer support, maintenance, upgrades, hosting costs and that's not even including marketing",
            "DO NOT START A TECH STARTUP WITHOUT A TECH FOUNDER\n\n\nIt will just become a money pit where you'll get some bad code in return.",
            "Entrepreneurs gain success by creating market value. What value are you creating? Your idea is to:\n\n1. Copy an existing market idea\n2. Have someone else create it for you\n3. Profit?",
            "Starting a Software as a Service (SaaS) business can be a great idea due to its scalable nature and recurring revenue model. It allows you to provide valuable software solutions to customers without the need for them to manage installations and updates, which enhances user experience and retention. Additionally, the market for SaaS is continually growing as businesses seek more efficient and cost-effective tools to manage their operations. However, it also requires substantial initial investment in development and ongoing costs for maintaining and improving the service. Success in the SaaS space often hinges on addressing a specific niche or problem effectively and offering excellent customer support."
        ],
        "sentiment": 0.1610048941798942,
        "score": 12.610048941798942
    },
    {
        "title": "Validating my SaaS idea",
        "upvotes": 1,
        "num_comments": 8,
        "comments": [
            "I wouldn't trust signups as an indicator of anything. For one thing, founders usually disregard anything that isn't telling them exactly what they want to hear. \n\nThis process you are conducting is best thought of as an invalidation, not as validation. Next, a lot of M&A is done via one-on-one communication. The other route is handled by sites like Flippa and others. \n\nIn other words, M&A runs on due diligence, not a general announcement you accept every charlatan who fancies themselves an investor and every near bankrupt basket case that can fudge some numbers to separate a rube from their money. While there might be a role for artificial intelligence in M&A, that is not blind aggregation because anybody can build a bot to scrape the 'net.",
            "Starting with a landing page and Facebook ads is a solid approach! Quality over quantity is key for signups. Best of luck with your validation process!",
            "I would love to help you validate this idea! We just recently started offering this as a free service with no obligation and I love to do it! \n\n[www.wgmilabs.com/idea-validation](http://www.wgmilabs.com/idea-validation)",
            "My idea is to just provide deal sourcing platform within one platform and provide powerful searching and data analytics services and if businesses have to do deals they have to go to the main source website. One of my competitor is withkumo.com",
            "bro i booked call on monday please have look on it booking of call is under name keval laheri. Your help is very appreciated.",
            "You just invalidated the only reason anybody would use the site. You do realize anybody over the last twenty years could and therefore hundreds did build a scraper bot. \n\nWhich is why -- belatedly -- you gave up on making it look like you had anything to bring to the market but \"Me Too.\" Even for venture capital bait, lame.\n\nNeo-maxi-zoom-dweebies should not go around using terms like \"natural language.\"",
            "Okay got it i think i have to think about new idea.",
            "You must mean because you can't develop artificial intelligence into a viable product for this space. Which is by solving the real cause of problems: Due Diligence. \n\nI have bad news on your next fifteen ideas."
        ],
        "sentiment": 0.14336647727272728,
        "score": 11.433664772727273
    },
    {
        "title": "Thought I found the perfect SaaS business idea...but it's patented?",
        "upvotes": 1,
        "num_comments": 7,
        "comments": [
            "You’ll want to talk to a patent attorney to confirm and explore options. Software patents are a bit of a black hole of confusion, and leans very heavily into the legalese type maneuvering. \n\nRealistically, the paths are going to come down to:\n- don’t build it\n- try to negotiate a license if you are in a different region that they are not pursuing\n- build it and wait for them to maybe send you a suit\n- in court your lawyer would either argue you have something novel or different that makes the patent not apply OR they’d argue the patent is too broad and ask to court to better define the boundaries that are protected by patent\n\nSource: I am not a lawyer, I have never fought a patent, I have talked with many people about patents. \n\nTLDR; Talk to a patent attorney and define your strategy!",
            "Seek out a patent attorney.  The key to patents is nuance.  You could get a patent on a screw, for instance, that has slightly different thread pattern because that thread pattern makes the screw 0.0001% stronger, but fundamentally it looks almost identical.  You need to seek a professional opinion on how to patent your idea to make it somewhat different.  The patent might only be worth the marketing aspect or it might only be worth a shield against a potential lawsuit by your perceived competitor, but you still need to talk details with a qualified patent professional to know how much, if any, latitude you have to move within the space without infringing the other company.",
            "Personally, I would build it anyway. Just don't use their product to gather ideas for your own, and make sure you're making it your own.\n\nThere are many ways to skin a cat, and if their patent is for an algorithm a+b=c, then maybe yours is b+a=c. They can only own specific methods of doing something with a patent, but they can't own the patent on every method of obtaining a certain result. They can't own general ideas or business models, either.\n\nAnd of course, like everyone else mentioned, talk to your lawyer.",
            "From my understanding software patents do not exist, it's only Intellectual Property (IP).  \nHardware patents? Yeah. It might be BS they're just posting to scare potential up-comers.",
            "Software patents absolutely exist. And I looked up their patent at the USPTO, I wasn't just looking at their website.",
            "Considering things, like Huawei's blatant 100-100 copy of the Apple watch, to the point it's hard to distinguish it up-close, alongside the way even the software looks I wouldn't care a single smudge over a company having a supposed \"patent\". It's all obfuscated and debatable anyway.\n\nGrok states:\n\nLegal Basis: In many jurisdictions, including the United States, Europe, and Japan, software can be patented if it meets certain criteria like novelty, non-obviousness, and utility. However, the specifics of what can be patented vary:  \n\n\n* U.S.: The U.S. allows patents for software if it's part of a machine or process, or if it's tied to a particular technological implementation (post-Alice Corp v. CLS Bank International case law).\n* Europe: The European Patent Office (EPO) grants patents for software that has a technical effect beyond just running on a computer.\n\nSo there's mostly hardware-based ties. IMHO, just go for it. Figure things out."
        ],
        "sentiment": 0.14486554533429533,
        "score": 10.448655453342953
    },
    {
        "title": "SAAS ideas",
        "upvotes": 1,
        "num_comments": 3,
        "comments": [
            "Interview 10 companies about their daily problems.\n\nOr find in love with a problem that you face yourself.",
            "saw someting on product hunt today, was called something like \"Find Problems\" or so, some ai that listed all problems it could find on reddit as a basis for saas solutions (have no idea if it is any good, didn't look at it any deeper)",
            "Hi there! Great idea!  If your interested, I run my own graphical design company and would love to develop any graphical help you may need. In terms of Logo,3D Product mockup or any other graphical help. Drop me a DM if interested!"
        ],
        "sentiment": 0.4576388888888889,
        "score": 9.57638888888889
    },
    {
        "title": "Roast my Idea: SaaS Validation Service",
        "upvotes": 0,
        "num_comments": 6,
        "comments": [
            "Hey man. It sounds nice to read about this idea and honestly it can work and your SaaS validation service idea has potential, but it needs refinement. While offering a comprehensive package is appealing, it might be overly ambitious and difficult to scale. Consider specializing in specific SaaS niches, providing ongoing support, and leveraging automation to improve efficiency. By focusing on delivering real value and actionable insights, you can differentiate your service and attract more clients. Good luck with your idea. i hope this helps.",
            "like a focus group - probably a good idea but it might be difficult to convince founders it’s actually a validation because many don’t know what they need until the product is made, and pre-product ideas aren’t really mature enough to say whether it’ll work or not until the iterative mvp process is happening and pivoting etc",
            "Yeah that makes sense. Thank you for your feedback.",
            "Yeah, that's true. Like if I told someone that it didn't seem to have any demand, would they even believe me? Or would they think I don't have the knowledge to pitch it? Thanks for the feedback!",
            "could be that it just becomes an advertising play to validate it so you still win there"
        ],
        "sentiment": 0.30366666666666664,
        "score": 9.036666666666665
    },
    {
        "title": "Best Steps to Validate a SaaS Idea?",
        "upvotes": 0,
        "num_comments": 2,
        "comments": [
            "All 3 are great. If you can't decide, why not do them all?\n\n1. create a waitlist\n\n2. start marketing\n\n3. build the MVP (if you're okay to share the process publicly, this can be even more marketing content as well)\n\nI'd say don't overthink it and start doing something. you'll learn along the way.",
            "Nice advice ! Thank you !"
        ],
        "sentiment": 0.69375,
        "score": 8.9375
    },
    {
        "title": "Trying to find the perfect remote job while running my early SaaS (any ideas?)",
        "upvotes": 0,
        "num_comments": 3,
        "comments": [
            "would love any advice Im 25! I know I can still make mistakes, for 5 more years",
            "Is $800–$1500 per month enough?",
            "yes Im living in Mexico. Im 25. without kids, maybe gf soon. but ideally I would love 1500"
        ],
        "sentiment": 0.42083333333333334,
        "score": 7.208333333333333
    },
    {
        "title": "AI and stocks , SAAS idea",
        "upvotes": 1,
        "num_comments": 2,
        "comments": [
            "Love the concept! Have you considered integrating sentiment analysis for stock trends?",
            "I had something similar in mind to determine overall rank of stock trend , but im having trouble understanding in detail what to do exactly , you can hit me up in dm and explain what you have in mind!"
        ],
        "sentiment": 0.24375,
        "score": 6.4375
    },
    {
        "title": "Next steps for my SaaS idea?",
        "upvotes": 1,
        "num_comments": 2,
        "comments": [
            "I’d highly recommend setting up a landing page as soon as possible—before the app is even fully launched. Given the growing demand, capturing early interest is crucial to building a strong user base from the start. A well-optimized landing page, combined with an email marketing strategy, can help you generate and nurture leads, ensuring that potential customers stay engaged until your product is ready.\n\nFrom my experience working with a high-growth business (outside of the medical field), I’ve seen firsthand how missed lead opportunities can become a major setback. You don’t want to wait until launch to start building an audience. Even if capital is a challenge, marketing now will help you test and refine your positioning, attract potential customers, and increase your chances of securing investment later. Moreover, building a waitlist of engaged users can be a strong validation point when approaching investors.\n\nWould love to hear more about your specific go-to-market strategy—are you planning on direct sales (B2B outreach) or inbound marketing to drive adoption?",
            "Start small and local. Face-to-face with medical businesses will give you real feedback and help perfect the product before scaling. Plus, those early adopters become great case studies.\n\nBubble is fine for validating your idea and getting initial traction. When you hit performance issues, that's actually a good problem - means you've found market fit.\n\nLanding page is secondary. Focus on getting 10 paying customers first. Their feedback will be worth more than any marketing spend right now."
        ],
        "sentiment": 0.18449570105820107,
        "score": 5.844957010582011
    },
    {
        "title": "Validating a micro-saas idea.",
        "upvotes": 1,
        "num_comments": 3,
        "comments": [
            "This certainly is what I've always said: Going where the money ain't. And you're trying to validate that people who don't want to pay for stuff don't. That takes talent. \n\nFinally, the idea of monetizing freeloaders is a master's touch. I feel good about everything I write here now. \n\nDon't you get it: opinions will not describe behavior. You'll get confirmation that people who won't pay you want you to build this for them, at best. Churn would be horrendous, at best. \n\nWait -- there is even less than meets the eye. You target people with such a hunger for zero pay options they can't keep track of their greed. Their eyes dwarf their wallets, and you feel you may get lucky with that? Wantrepreneur chrismas -- monetization day -- comes earlier every year. \n\nOh damn, we so need a name for these bottom-feeders: Zero Bingers. \n\nThat is why \"Hey Market, Wutcha Want\" does not work. And why I have so little sympathy when the inevitable follow-up posts describe this train wreck. This is why we can't have nice things here, like paying customers. People go out-of-their way targeting non-paying ones. \n\nI justdonteven.\n\nTIL People lie to get what they want. Well, that's something I thought everybody knew.",
            "Hehe, I’m only starting out. I think atleast what I did right was to try and ask if the idea makes any sense. Thanks for your input though, this must be the most comprehensive one.",
            "If you mean you were born yesterday, *that I believe.*"
        ],
        "sentiment": 0.058587962962962974,
        "score": 5.58587962962963
    },
    {
        "title": "Game-Changer or Overkill? Seeking Feedback on a SaaS Idea for Marketing Agencies",
        "upvotes": 1,
        "num_comments": 3,
        "comments": [
            "The idea does address real pain points but the chatbots seem unnecessary to me. \n\nStart with a simple version of the product (maybe just the automation tools), have some agencies test it, get feedback and add/improve features based on that. \n\nReal validation is when someone pays for it, not tells you they'll use it.",
            " totally get you on that, starting simple makes sense. The hype around chatbots can be a distraction if the core is solid. Testing with real agencies will give those insights you need, and if they’re actually willing to pay, that’s when you know you got something. It’s all about that MVP and iterating from there, fam.",
            "Thank you for your feedback, we are working on building our MVP and once it's done we are gonna launch it and ask for feedback from the digital marketing people and agencies, and we included chatbot to differentiate ourselves from others in the market, this post is just for initial idea validation,so i wanted to ask u how much would you rate this idea out of 10"
        ],
        "sentiment": 0.04722222222222222,
        "score": 5.472222222222222
    },
    {
        "title": "Exploring an Idea for Video Streaming SaaS - Seeking Feedback",
        "upvotes": 1,
        "num_comments": 3,
        "comments": [
            "I recommend you build an MVP.",
            "Here's a [waitlist](https://dashing-salto-a0f.notion.site/140e6e87a9f580a199faf1a9acad8f0b?pvs=105) if you'd like to stay updated on the progress.",
            "any progress?"
        ],
        "sentiment": 0.0,
        "score": 5.0
    },
    {
        "title": "SaaS Founders: What's the Most Interesting Way You've Discovered New Product Ideas?",
        "upvotes": 0,
        "num_comments": 2,
        "comments": [
            "Copying what I said in another sub you asked this is \n\nI created an html and css component library called CodeStitch. I came up with it a couple years ago when I was talking to my dev and designer buddies after finishing a large project. My dev friend asked if anyone had any leads or ideas on the next thing to work on and I said “it would be nice if I had a little library I could browse by website sections and see the displays of website sections I made and click a button to copy and paste them into my project so I can reuse my code snippets much easier and build my websites faster” and he said “dude I would use this today. How much do you need?”\n\n3 years ago probably $100k later we are doing pretty well with almost 4K users and 1k member discord server for freelancers and users to share their creations and get advice. We got a nice little community going go also had the same need but there wasn’t anything on the market to do it for them.\n\nTheres a new tailwind component library every week. But there’s not a single good HTML and CSS competent library out there with good designs and clean code. I kept trying to reuse my own code as much as possible but it was a pain finding what I want to use, opening the files up, finding the code, and integrating it into the new site. It was a hassle. But there was no tool to store my code and see a display image of what that code made so I can browse sections at a glance. And every html and css template library I found was not great… nothing I could use for a contractor or restaurant. Huge hole in the market. And now I know why. It was f**cking hard and expensive. lol and the upkeep alone. We got 2 devs working on it with me and one just transitioned to full time this week. We have ongoing design and development costs to make new templates every month. We as founder don’t make any money yet from it and spend dozens of hours a week on it. Everything goes back into the business to sustain it, improve it, and grow it. Thats the thing when you found a start up. The founders are the last to get paid. We’re on a good track though.\n\nI’d say I’m our biggest user. I use it to make all my websites now. And it’s working exactly as I wanted it to when I first pitched it to my team. I love it and I’m so happy I was lucky to be surrounded by people who can make my idea come to life and build it and who believed in it.",
            "Thank you for sharing your experience. I'm about to embark on my journey as a solopreneur by launching some digital products (SaaS), and I'm finding it challenging to come up with new ideas. From what I've gathered, the best source of inspiration is identifying solutions to personal problems."
        ],
        "sentiment": 0.28999554367201424,
        "score": 4.899955436720143
    },
    {
        "title": "Get ideas for micro SaaS here",
        "upvotes": 1,
        "num_comments": 2,
        "comments": [
            "AAA AI Automation Agency",
            "After some research, I think you'd do well with multiple comparison calculators, to show what processes are like before and after hiring you. Like...\n\n* AI ROI calculator\n* AI CaC Calculator\n* AI Profit Margin Calculator\n\nInput: Industry and Email address\n\nOutput: Left-hand side shows long list of old, busted, manual processes. Right side shows the new process which can be reduced to 2 or 3 automated steps. Then dollar figures below each side to show the difference.\n\nHope that helps, let me know if it raises any questions."
        ],
        "sentiment": 0.047207792207792205,
        "score": 4.472077922077922
    },
    {
        "title": "[Saas Idea] Organize my google drive",
        "upvotes": 1,
        "num_comments": 1,
        "comments": [
            "40 bucks is crazy\n\n>sends you a list of meaningful folders it inferred from your data, you can confirm if list is ok or modify it and send it back to bot\n\nI mean, even as freeware this wouldn't be popular."
        ],
        "sentiment": 0.11458333333333333,
        "score": 4.145833333333333
    },
    {
        "title": " Validating SaaS Ideas with Waiting Lists – Your Insights? ",
        "upvotes": 2,
        "num_comments": 0,
        "comments": [],
        "sentiment": 0.0,
        "score": 4.0
    },
    {
        "title": "Help me validate my SaaS idea",
        "upvotes": 1,
        "num_comments": 2,
        "comments": [
            "[removed]",
            "Depends on what you can/have done shoot me a dm on reddit and If i like it i will dm you on discord"
        ],
        "sentiment": 0.0,
        "score": 4.0
    },
    {
        "title": "Prototyping a SaaS and Protecting Your Idea",
        "upvotes": 1,
        "num_comments": 1,
        "comments": [
            "Sent Dm to discuss further. Thank you."
        ],
        "sentiment": 0.0,
        "score": 3.0
    },
    {
        "title": "Is This the Right SaaS Idea? Would You Pay for It?",
        "upvotes": 0,
        "num_comments": 2,
        "comments": [
            "Would this tool allow you to customize the metrics you track? It seems like a solid idea since many small biz owners just want straightforward insights without the hassle. If you can keep it simple and user-friendly, you could definitely fill a gap in the market. Plus, the WhatsApp and email reports are a smart move—nobody wants to log in daily just to check numbers.",
            "Yes It does allow the user to choose the specific metrics it tracks. While also I forgot to add there would be an AI system that would recommend key actions to take to increase revenue and customers"
        ],
        "sentiment": 0.05773809523809524,
        "score": 2.5773809523809526
    },
    {
        "title": "I Found This SaaS Idea in a Reddit Post, and Now It Can Helping Businesses Win More Bids! 🚀",
        "upvotes": 1,
        "num_comments": 0,
        "comments": [],
        "sentiment": 0.0,
        "score": 2.0
    },
    {
        "title": "Entrepreneurs from small non-english speaking countries: How to validate an international SaaS idea?",
        "upvotes": 1,
        "num_comments": 1,
        "comments": [
            "Non US market is dead imo, ppl are too reserved"
        ],
        "sentiment": -0.2,
        "score": 1.0
    }
]